MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ192GB110/mcu.h
#define _CNPD3_CN37PDE_POSITION                  0x00000005
#define _CNPD3_CN37PDE_MASK                      0x00000020
#define _CNPD3_CN37PDE_LENGTH                    0x00000001

#define _CNPD3_CN38PDE_POSITION                  0x00000006
#define _CNPD3_CN38PDE_MASK                      0x00000040
#define _CNPD3_CN38PDE_LENGTH                    0x00000001

#define _CNPD3_CN39PDE_POSITION                  0x00000007
#define _CNPD3_CN39PDE_MASK                      0x00000080
#define _CNPD3_CN39PDE_LENGTH                    0x00000001

#define _CNPD3_CN40PDE_POSITION                  0x00000008
#define _CNPD3_CN40PDE_MASK                      0x00000100
#define _CNPD3_CN40PDE_LENGTH                    0x00000001

#define _CNPD3_CN41PDE_POSITION                  0x00000009
#define _CNPD3_CN41PDE_MASK                      0x00000200
#define _CNPD3_CN41PDE_LENGTH                    0x00000001

#define _CNPD3_CN42PDE_POSITION                  0x0000000A
#define _CNPD3_CN42PDE_MASK                      0x00000400
#define _CNPD3_CN42PDE_LENGTH                    0x00000001

#define _CNPD3_CN43PDE_POSITION                  0x0000000B
#define _CNPD3_CN43PDE_MASK                      0x00000800
#define _CNPD3_CN43PDE_LENGTH                    0x00000001

#define _CNPD3_CN44PDE_POSITION                  0x0000000C
#define _CNPD3_CN44PDE_MASK                      0x00001000
#define _CNPD3_CN44PDE_LENGTH                    0x00000001

#define _CNPD3_CN45PDE_POSITION                  0x0000000D
#define _CNPD3_CN45PDE_MASK                      0x00002000
#define _CNPD3_CN45PDE_LENGTH                    0x00000001

#define _CNPD3_CN46PDE_POSITION                  0x0000000E
#define _CNPD3_CN46PDE_MASK                      0x00004000
#define _CNPD3_CN46PDE_LENGTH                    0x00000001

#define _CNPD3_CN47PDE_POSITION                  0x0000000F
#define _CNPD3_CN47PDE_MASK                      0x00008000
#define _CNPD3_CN47PDE_LENGTH                    0x00000001

#define _CNPD4_CN48PDE_POSITION                  0x00000000
#define _CNPD4_CN48PDE_MASK                      0x00000001
#define _CNPD4_CN48PDE_LENGTH                    0x00000001

#define _CNPD4_CN49PDE_POSITION                  0x00000001
#define _CNPD4_CN49PDE_MASK                      0x00000002
#define _CNPD4_CN49PDE_LENGTH                    0x00000001

#define _CNPD4_CN50PDE_POSITION                  0x00000002
#define _CNPD4_CN50PDE_MASK                      0x00000004
#define _CNPD4_CN50PDE_LENGTH                    0x00000001

#define _CNPD4_CN51PDE_POSITION                  0x00000003
#define _CNPD4_CN51PDE_MASK                      0x00000008
#define _CNPD4_CN51PDE_LENGTH                    0x00000001

#define _CNPD4_CN52PDE_POSITION                  0x00000004
#define _CNPD4_CN52PDE_MASK                      0x00000010
#define _CNPD4_CN52PDE_LENGTH                    0x00000001

#define _CNPD4_CN53PDE_POSITION                  0x00000005
#define _CNPD4_CN53PDE_MASK                      0x00000020
#define _CNPD4_CN53PDE_LENGTH                    0x00000001

#define _CNPD4_CN54PDE_POSITION                  0x00000006
#define _CNPD4_CN54PDE_MASK                      0x00000040
#define _CNPD4_CN54PDE_LENGTH                    0x00000001

#define _CNPD4_CN55PDE_POSITION                  0x00000007
#define _CNPD4_CN55PDE_MASK                      0x00000080
#define _CNPD4_CN55PDE_LENGTH                    0x00000001

#define _CNPD4_CN56PDE_POSITION                  0x00000008
#define _CNPD4_CN56PDE_MASK                      0x00000100
#define _CNPD4_CN56PDE_LENGTH                    0x00000001

#define _CNPD4_CN57PDE_POSITION                  0x00000009
#define _CNPD4_CN57PDE_MASK                      0x00000200
#define _CNPD4_CN57PDE_LENGTH                    0x00000001

#define _CNPD4_CN58PDE_POSITION                  0x0000000A
#define _CNPD4_CN58PDE_MASK                      0x00000400
#define _CNPD4_CN58PDE_LENGTH                    0x00000001

#define _CNPD4_CN59PDE_POSITION                  0x0000000B
#define _CNPD4_CN59PDE_MASK                      0x00000800
#define _CNPD4_CN59PDE_LENGTH                    0x00000001

#define _CNPD4_CN60PDE_POSITION                  0x0000000C
#define _CNPD4_CN60PDE_MASK                      0x00001000
#define _CNPD4_CN60PDE_LENGTH                    0x00000001

#define _CNPD4_CN61PDE_POSITION                  0x0000000D
#define _CNPD4_CN61PDE_MASK                      0x00002000
#define _CNPD4_CN61PDE_LENGTH                    0x00000001

#define _CNPD4_CN62PDE_POSITION                  0x0000000E
#define _CNPD4_CN62PDE_MASK                      0x00004000
#define _CNPD4_CN62PDE_LENGTH                    0x00000001

#define _CNPD4_CN63PDE_POSITION                  0x0000000F
#define _CNPD4_CN63PDE_MASK                      0x00008000
#define _CNPD4_CN63PDE_LENGTH                    0x00000001

#define _CNPD5_CN64PDE_POSITION                  0x00000000
#define _CNPD5_CN64PDE_MASK                      0x00000001
#define _CNPD5_CN64PDE_LENGTH                    0x00000001

#define _CNPD5_CN65PDE_POSITION                  0x00000001
#define _CNPD5_CN65PDE_MASK                      0x00000002
#define _CNPD5_CN65PDE_LENGTH                    0x00000001

#define _CNPD5_CN66PDE_POSITION                  0x00000002
#define _CNPD5_CN66PDE_MASK                      0x00000004
#define _CNPD5_CN66PDE_LENGTH                    0x00000001

#define _CNPD5_CN67PDE_POSITION                  0x00000003
#define _CNPD5_CN67PDE_MASK                      0x00000008
#define _CNPD5_CN67PDE_LENGTH                    0x00000001

#define _CNPD5_CN68PDE_POSITION                  0x00000004
#define _CNPD5_CN68PDE_MASK                      0x00000010
#define _CNPD5_CN68PDE_LENGTH                    0x00000001

#define _CNPD5_CN69PDE_POSITION                  0x00000005
#define _CNPD5_CN69PDE_MASK                      0x00000020
#define _CNPD5_CN69PDE_LENGTH                    0x00000001

#define _CNPD5_CN70PDE_POSITION                  0x00000006
#define _CNPD5_CN70PDE_MASK                      0x00000040
#define _CNPD5_CN70PDE_LENGTH                    0x00000001

#define _CNPD5_CN71PDE_POSITION                  0x00000007
#define _CNPD5_CN71PDE_MASK                      0x00000080
#define _CNPD5_CN71PDE_LENGTH                    0x00000001

#define _CNPD5_CN74PDE_POSITION                  0x0000000A
#define _CNPD5_CN74PDE_MASK                      0x00000400
#define _CNPD5_CN74PDE_LENGTH                    0x00000001

